{
  "overallFeedback": [
    {
      "from": 0,
      "to": 100
    }
  ],
  "behaviour": {
    "inputFieldSize": "10",
    "enableRetry": true,
    "ignoreScoring": false,
    "pointsHost": 1,
    "linebreakReplacement": " "
  },
  "checkAnswer": "Check",
  "submitAnswer": "Submit",
  "tryAgain": "Retry",
  "showSolution": "Show solution",
  "feedbackHeader": "Feedback",
  "solutionTitle": "Sample solution",
  "remainingChars": "Remaining characters: @chars",
  "notEnoughChars": "You must enter at least @chars characters!",
  "messageSave": "saved",
  "ariaYourResult": "You got @score out of @total points",
  "ariaNavigatedToSolution": "Navigated to newly included sample solution after textarea.",
  "ariaCheck": "Check the answers.",
  "ariaShowSolution": "Show the solution. You will be provided with a sample solution.",
  "ariaRetry": "Retry the task. You can improve your previous answer if the author allowed that.",
  "taskDescription": "Because relationships are so important in marketing, multiple tools have been developed to help manage customer relationships. Many technological advances assist marketers in their efforts. Promotional strategies include utilizing social media posts, websites, advertising, public relations, and sponsorships to communicate with the target audience. One of the most effective tools in planning/calendaring these promotional contacts or touch points is a Gantt chart. Do a bit of research on Gantt charts so you better understand this scheduling tool that also visually illustrates linkages between promotional activities and progress toward a marketing goal. List and discuss five benefits of using this CRM planning tool. Finally, in your research, did you discover an alternative method to visually depict a marketing project schedule?",
  "isSolutionPublic": true,
  "solution": {
    "introduction": "",
    "sample": ""
  },
  "keywords": [
    {
      "options": {
        "points": 1,
        "occurrences": 1,
        "caseSensitive": false,
        "forgiveMistakes": false,
        "feedbackIncludedWord": "keyword",
        "feedbackMissedWord": "none"
      },
      "keyword": "*"
    }
  ]
}